# YOLOv8n-CASM 模型配置
# 基于 Connectivity Attention Strip Module 增强的 YOLOv8n

# 类别数
nc: 80

# 尺度比例 (深度/宽度)
depth_multiple: 1.0  # 模型深度缩放因子
width_multiple: 1.0  # 模型宽度缩放因子

# 骨干网络 (Backbone)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 3, CASMBlock, [128, 19, True]]   # 2-P2/4 + CASM
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 3, CASMBlock, [256, 19, True]]   # 4-P3/8 + CASM
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 3, CASMBlock, [512, 19, True]]   # 6-P4/16 + CASM
  - [-1, 1, Conv, [512, 3, 2]]             # 7-P5/32
  - [-1, 3, CASMBlock, [512, 19, True]]   # 8-P5/32 + CASM
  - [-1, 1, SPPF_CASM, [512, 5, 19]]       # 9-P5/32 + SPPF+CASM

# 颈部网络 (Neck)
neck:
  - [-1, 1, Conv, [256, 1, 1]]             # 10
  - [-2, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, -3], 1, C2f_CASM, [256, 2, 19, False]]  # 12 - C2f_CASM
  - [-1, 1, Conv, [128, 1, 1]]             # 13
  - [-2, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, -4], 1, C2f_CASM, [128, 2, 19, False]]  # 15 - C2f_CASM
  - [-1, 1, Conv, [128, 3, 2]]             # 16
  - [[-1, -4], 1, C2f_CASM, [256, 2, 19, False]]  # 17 - C2f_CASM
  - [-1, 1, Conv, [256, 3, 2]]             # 18
  - [[-1, -4], 1, C2f_CASM, [512, 2, 19, False]]  # 19 - C2f_CASM

# 检测头 (Head)
head:
  - [[15, 17, 19], 1, Detect, [nc]]        # Detect(P3, P4, P5)
